{
	"data": {

		"portfolio": true,
		"portfolioPieces": [
			{
				"backgroundImg": "https://i.imgur.com/YyXicLa.png",
				"title": "Fred Rogers",
				"url": "https://www.fredrogers.org/",
				"story": "A project close to my heart, I had grown up on Fred Rogers the same as everyone in my generation! When we got the project, I got to meet the lead of his brand, and work with them on a design. After the design was completed I had built components requiring JavaScript to ensure their design needs were met. I built the rest of the site and implemented my JavaScript solutions, building the store with Drupal as they asked for easy continuous support. ",
				"tech": [
					{
						"list": [
							"Drupal",
							"CSS",
							"HTML",
							"Video",
							"Javascript"
						]
					}
				]
			},
			{
				"backgroundImg": "https://i.imgur.com/W0R1USR.png",
				"title": "PA Lottery",
				"url": "https://www.palottery.state.pa.us/",
				"story": "The PA Lottery was built before I was brought on, however the amount of legacy code and outdated or broken CSS was something we had to find solutions for. I have been a part of the team pushing forward on cleaning it up and making the site more maintainable for what surely will be an ever-growing web presence. I have made JavaScript solutions to solve various issues – some involving API calls, some detecting types of content and amount and updating its styles from there, all to make sure the site is ready to produce and show new marketing as needed. Marketing on the site updates on strict schedules, and sometimes rather suddenly, requiring clean solutions to make sure it is ready to go and update as needed with the least amount of downtime.</p> <p>Along with full time support of the website, I have also created marketing emails, and an automated Style Guide that is ran by Handlebars.js to ensure that the future solutions can be as clean as possible. Using the Style Guide has led to massive improvements of development time to handle the ongoing revamp and rebuilds of the site and components!",
				"tech": [
					{
						"list": [
							"SASS",
							"Javascript",
							"Ajax",
							"Emails",
							"Handlebars"
						]
					}
				]	
			},
			{
				"backgroundImg": "https://i.imgur.com/eEli9ED.png",
				"title": "Women of color network",
				"url": "http://www.wocninc.org/",
				"story": "Foundations supporting the communities trying to escape violence and trying to help those in need hold a special place in my heart. When we were approached by the WOCN to develop their new site we took it without a second though! They already had a design and the content prepared from another group, we took that content and found a solution for it within WordPress that way the site could receive continuous updates from them as needed. I developed a WordPress template, and found the proper plugins to help them reach their goal! Has been redesigned since we took on the project.",
				"tech": [
					{
						"list": [
							"Wordpress",
							"PHP",
							"CSS",
							"HTML"
						]
					}
				]	
			},
			{
				"backgroundImg": "https://i.imgur.com/8wNYimD.png",
				"title": "Mylan",
				"url": "http://www.mylan.com/",
				"story": "At my time at Ciber, I was full time supporting Mylan’s projects. At the time they had an English website and that was needing a solution to move the websites design to support other languages. I helped them reach that goal by making solutions and choices with a small team of designers and backend architects. After the creation of a template that would support other languages, we implemented the HTML into SiteCore. After the creation of several languages, I had gone through and revamped mobile to ensure it could outreach to the maximum amount of people.",
				"tech": [
					{
						"list": [
							"SiteCore",
							"CSS",
							"HTML",
							"ASP.Net / MVC",
							"Javascript"
						]
					}
				]	
			},
			{
				"backgroundImg": "https://i.imgur.com/U0wCpZb.png",
				"title": "Epipen",
				"url": "https://www.epipen.com/en",
				"story": "After helping support and create solutions for Mylan.com I was asked to help support EpiPen, Mylan’s leading product. A backend was created along with templates at this point of the projects life, I helped the team get to the finish line by fixing and creating new JavaScript solutions connecting to the back-end API. I helped and gave continuous support helping them create a mobile solution for maximum customer help!",
				"tech": [
					{
						"list": [
							"Sitecore",
							"CSS",
							"Javascript",
							"Ajax",
							"HTML",
							"ASP.Net / MVC",
							"Entity Framework"
						]
					}
				]	
			},
			{
				"backgroundImg": "https://i.imgur.com/Z3G43uL.png",
				"title": "United Refactories Co",
				"url": "https://urc4u.com/",
				"story": "At the beginning of my time at the Agency that created the URC website I was tasked to wrap up the project. I went through and improved the SEO in the WordPress side of things and cleaned up and condensed the CSS to increase load times.",
				"tech": [
					{
						"list": [
							"CSS",
							"HTML",
							"Javascript"
						]
					}
				]	
			},
			{
				"backgroundImg": "https://i.imgur.com/IQFAN0l.png",
				"title": "Center Rock",
				"url": "https://centerrock.com/",
				"story": "This was my first project as an intern, and my first ‘real life’ experience with web development. Our agency chose to use WordPress due to the updating nature of the company with products, offers, news, and services. I created the original WordPress site using a pre-existing template and grabbing plugins that were needed to get a rough draft done. After the initial rough draft was complete, I had gone and cleaned up parts of the JavaScript, CSS, and the PHP that were from the template and plugins to match the client approved designs. It was a great way to hit the ground running!",
				"tech": [
					{
						"list": [
							"Wordpress",
							"PHP",
							"CSS",
							"HTML",
							"Javascript"
						]
					}
				]	
			},
			{
				"backgroundImg": "https://i.imgur.com/wJyOWNs.png",
				"title": "Wabtec",
				"url": "https://www.wabtec.com/",
				"story": "A short project, but a unique one for me! An early stage of my career, Wabtec had requested our Agency to create wireframes considering for all their regional location sites, which was roughly 100 or so. I went through, found the common and necessary parts of each site and created a wireframe to allow them to move forward with a solution based upon that wireframe. Soon after that I implemented a solution for 3D viewing on some of their tools based on JavaScript.",
				"tech": [
					{
						"list": [
							"Wireframe",
							"Javascript"
						]
					}
				]	
			}
		]
	}
}